app/controllers/equipment_controller.rb

  def index
    @search = current_user_role.equipment.search(params[:search])
---
SELECT * FROM "equipment"