app/controllers/equipments_controller.rb

SELECT * FROM "equipment"
---
  def index
    @search = current_user_role.equipments.search(params[:search])

SELECT * FROM "equipment" WHERE ("equipment"."id" = 1)
---
  def show
    @equipment = current_user_role.equipments.find(params[:id])

INSERT INTO "equipment" ("name", "updated_at", "code", "maintenance_periodicity_in_months", "description", "note", "created_at") VALUES('Caldaia NetFire', '2009-07-26 08:53:34', '01', 12, 'Caldaia 5000 litri', 'Modello 2007', '2009-07-26 08:53:34')
---
  def create
    @equipment = current_user_role.equipments.build(params[:equipment])
    if @equipment.save