app/controllers/maintenances_controller.rb

  def index
    @search = current_user_role.maintenances.search(params[:search])
---
SELECT * FROM "maintenances"

  def show
    @maintenance = current_user_role.maintenances.find(params[:id])
---
SELECT * FROM "maintenances" WHERE ("maintenances"."id" = 1)

  def create
    @maintenance = current_user_role.maintenances.build(params[:maintenance])
    if @maintenance.save
---
INSERT INTO "maintenances" ("scheduled_date_at", "duration_in_hours", "accepted", "completed", "effective_date_at", "updated_at", "client_id", "technician_id", "equipment_id", "note", "service_type", "created_at") VALUES('2009-07-26', 2.0, 't', 'f', '2009-07-26', '2009-07-26 09:30:48', 5, 3, 1, 'nothing special', 'scheduled assistance operations', '2009-07-26 09:30:48')

  def edit
    @maintenance = current_user_role.maintenances.find(params[:id])
---
SELECT * FROM "maintenances" WHERE ("maintenances"."id" = 1)