app/controllers/users_controller.rb

  def show
    @user = class_by_user_role(User.find(params[:id]))
---
SELECT * FROM "users" WHERE ("users"."id" = 5) AND ("users"."role" = 'client')

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "updated_at", "role", "created_at") VALUES('Alfred', '2009-07-26 08:57:24', 'administrator', '2009-07-26 08:57:24')

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 8)